vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
              // Disable Reset Vector Catch in DEMCR
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));
              
              //Clear BP0 and FPB
              Write32(0xE0002008, 0);                         // Clear BP0
              Write32(0xE0002000, 0x00000002);                // Disable FPB
            </block>
          </sequence>
          <sequence name='ResetSystem'>
            <block>
              // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
              __var SCS_Addr   = 0xE000E000;
              __var AIRCR_Addr = SCS_Addr + 0xD0C;
              __var DHCSR_Addr = SCS_Addr + 0xDF0;
              
              __errorcontrol = 0x1;     // Skip errors, write to AIRCR.SYSRESETREQ may not be able to finish with OK response
              
              // Execute SYSRESETREQ via AIRCR
              Write32(AIRCR_Addr, 0x05FA0004);
              
              __errorcontrol = 0x0;     // Honor errors again
              
              DAP_Delay(20000);         // Delay of 20ms to let reset finish. Otherwise access to DHCSR can fail with too fast debug units.
            </block>
            <!-- Reset Recovery: Wait for DHCSR.S_RESET_ST bit to clear on read -->
            <control while='(Read32(DHCSR_Addr) &amp; 0x02000000)' timeout='500000'/>
          </sequence>
        </sequences>
        <memory name='NCACHE_REGION' start='0x20208000' size='0x8000' access='rw' default='1'/>
        <memory name='ROMCP' start='0x00200000' size='0x010000' access='rx' default='1'/>
        <memory name='SRAM_DTC' start='0x20000000' size='0x8000' access='rw' default='1'/>
        <memory name='SRAM_ITC' start='0x00000000' size='0x8000' access='rw' default='1'/>
        <memory name='SRAM_OC' start='0x20200000' size='0x8000' access='rw' default='1'/>
        <algorithm name='devices/MIMXRT1011/arm/MIMXRT1011_QuadSPI_4KB_SEC.FLM' start='0x60000000' size='0x01000000' RAMstart='0x20000000' RAMsize='0x00008000' default='1'/>
        <debug svd='devices/MIMXRT1011/MIMXRT1011.xml'/>
        <variant Dvariant='MIMXRT1011DAE5A'>
          <compile header='devices/MIMXRT1011/fsl_device_registers.h' define='CPU_MIMXRT1011DAE5A'/>
        </variant>
        <variant Dvariant='MIMXRT1011CAE4A'>
          <compile header='devices/MIMXRT1011/fsl_device_registers.h' define='CPU_MIMXRT1011CAE4A'/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id='device.MIMXRT1011.internal_condition'>
      <accept Dname='MIMXRT1011CAE4A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1011DAE5A' Dvendor='NXP:11'/>
    </condition>
    <condition id='cmake_toolchain.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.device=MIMXRT1011.internal_condition'>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.ak4497_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.at_least_one_i2c_mux_device_enabled.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_mux_pca954x, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_mux_pca954x'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.audio_sai_edma_adapter.condition_id'>
      <require condition='allOf.driver.sai_edma, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.sai_edma, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='sai_edma'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.button.condition_id'>
      <require condition='allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.allOf=component.igpio_adapter, driver.igpio.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.igpio_adapter, driver.igpio.internal_condition'>
      <accept condition='allOf.component.igpio_adapter, driver.igpio.internal_condition'/>
    </condition>
    <condition id='allOf.component.igpio_adapter, driver.igpio.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='igpio_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
    </condition>
    <condition id='component.cmsis_drivers.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.codec_adapters.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.codec_i2c.condition_id'>
      <require condition='allOf.component.i2c_adapter_interface, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_adapter_interface, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_adapter_interface'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.cs42448_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.cs42888_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.da7212_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
