vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
    <condition id='component.eeprom_AT25Fxxxx.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.eeprom_AT45DBxxxx.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.eeprom_InternalFlash.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9544.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.enable_pca9548.condition_id'>
      <require condition='allOf.component.i2c_mux_pca954x, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.exception_handling_cm7.condition_id'>
      <require condition='allOf.utility.assert, utility.debug_console, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.utility.assert, utility.debug_console, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.flash_nand_flexspi.condition_id'>
      <require condition='allOf.driver.flexspi, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexspi, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.flash_nor_flexspi.condition_id'>
      <require condition='allOf.driver.flexspi, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.flash_nor_lpspi.condition_id'>
      <require condition='allOf.driver.lpspi, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lpspi, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.gpt_adapter.condition_id'>
      <require condition='allOf.driver.gpt, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.gpt, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.i2c_adapter_interface.condition_id'>
      <require condition='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <accept condition='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpi2c_adapter'/>
    </condition>
    <condition id='anyOf.driver.lpi2c.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
    </condition>
    <condition id='component.i2c_mux.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.i2c_mux_pca954x.condition_id'>
      <require condition='allOf.component.i2c_mux, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.i2c_mux, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_mux'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.igpio_adapter.condition_id'>
      <require condition='allOf.driver.igpio, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.igpio, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.led.condition_id'>
      <require condition='allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, driver.common, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, driver.common, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.allOf=component.igpio_adapter, driver.igpio.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.lists.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.log.condition_id'>
      <require condition='allOf.driver.common, utility.str, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.str, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console_lite.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.log.backend.ringbuffer.condition_id'>
      <require condition='allOf.component.log, driver.common, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.lpi2c_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.lpi2c.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_adapter_interface'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.lpspi_adapter.condition_id'>
      <require condition='allOf.driver.common, driver.lpspi, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.lpspi, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.lpuart_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.lpuart, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.lpuart, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.lpuart.internal_condition'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.lpuart.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
    </condition>
    <condition id='component.lpuart_dma_adapter.condition_id'>
      <require condition='allOf.anyOf=driver.edma, component.lpuart_adapter, component.timer_manager, driver.lpuart, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, component.lpuart_adapter, component.timer_manager, driver.lpuart, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='timer_manager'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
