vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
    <condition id='allOf.component.rng_adapter_interface, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rng_adapter_interface'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.tfa9896_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.tfa9xxx_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.timer_manager.condition_id'>
      <require condition='allOf.anyOf=allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.gpt_adapter, driver.gpt, allOf=component.pit_adapter, driver.pit.internal_condition'>
      <accept condition='allOf.component.gpt_adapter, driver.gpt.internal_condition'/>
      <accept condition='allOf.component.pit_adapter, driver.pit.internal_condition'/>
    </condition>
    <condition id='allOf.component.gpt_adapter, driver.gpt.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpt'/>
    </condition>
    <condition id='allOf.component.pit_adapter, driver.pit.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit'/>
    </condition>
    <condition id='component.trng_adapter.condition_id'>
      <require condition='allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.rng_adapter_interface, driver.trng, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rng_adapter_interface'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='trng'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.wm8524_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.wm8904_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.wm8960_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='component.wm8962_adapter.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='device.CMSIS.condition_id'>
      <require condition='allOf.CMSIS_Include_core_cm, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Include_core_cm, device=MIMXRT1011.internal_condition'>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='device.RTE.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='device.boot_header.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='device_id.MIMXRT1011xxxxx.internal_condition'>
      <accept Dname='MIMXRT1011CAE4A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1011DAE5A' Dvendor='NXP:11'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MIMXRT1011xxxxx.internal_condition'>
      <require condition='device_id.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='device_ids.MIMXRT1011xxxxx.internal_condition'>
      <accept Dname='MIMXRT1011CAE4A' Dvendor='NXP:11'/>
      <accept Dname='MIMXRT1011DAE5A' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MIMXRT1011xxxxx.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MIMXRT1011xxxxx.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MIMXRT1011xxxxx.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.device_id=MIMXRT1011xxxxx, CMSIS_Include_core_cm, device.startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.dcdc_1, driver.gpc_1, driver.src, driver.pmu, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MIMXRT1011xxxxx, CMSIS_Include_core_cm, device.startup, driver.clock, driver.common, driver.igpio, driver.iomuxc, driver.dcdc_1, driver.gpc_1, driver.src, driver.pmu, device.boot_header, component.lpuart_adapter, utility.debug_console_lite, utility.assert_lite, utility.str.internal_condition'>
      <require condition='device_id.MIMXRT1011xxxxx.internal_condition'/>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='iomuxc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dcdc_1'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='src'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pmu'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='xip_device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_adapter'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1011_system'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.device.CMSIS, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1011_header'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.adc_12b1msps_sar.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
