vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
    <condition id='driver.dialog7212.condition_id'>
      <require condition='allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.component.codec_adapters, component.codec_i2c, component.da7212_adapter, driver.codec, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_adapters'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec_i2c'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='da7212_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='codec'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.display-adv7535.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.driver.display-common, driver.video-i2c, device=MIMXRT1011.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='display-common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='video-i2c'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.display-common.condition_id'>
      <require condition='allOf.driver.video-common, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.display-it6161.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.display-it6263.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.display-sn65dsi83.condition_id'>
      <require condition='allOf.driver.display-common, driver.video-i2c, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.dmamux.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.edma.condition_id'>
      <require condition='allOf.driver.common, driver.dmamux, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.dmamux, device_id=MIMXRT1011xxxxx.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dmamux'/>
      <require condition='device_id.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.ektf2k.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.ewm.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexio.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2c_master.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flexio, device_id=MIMXRT1011xxxxx.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio'/>
      <require condition='device_id.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2s.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexio_i2s_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexio_i2s, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexio_i2s, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_i2s'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexio_spi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexio_spi, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexio_spi, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_spi'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart.condition_id'>
      <require condition='allOf.driver.flexio, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexio_uart_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexio_uart, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexio_uart, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexio_uart'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.flexram.condition_id'>
      <require condition='allOf.driver.common, driver.flexram_allocate, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.flexram_allocate, device_id=MIMXRT1011xxxxx.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='soc_flexram_allocate'/>
      <require condition='device_id.MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexram_allocate.condition_id'>
      <require condition='allOf.driver.common, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.flexspi.condition_id'>
      <require condition='allOf.driver.common, device_id=MIMXRT1011xxxxx.internal_condition'/>
    </condition>
    <condition id='driver.flexspi_edma.condition_id'>
      <require condition='allOf.anyOf=driver.edma, driver.flexspi, device=MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.edma, driver.flexspi, device=MIMXRT1011.internal_condition'>
      <require condition='anyOf.driver.edma.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flexspi'/>
      <require condition='device.MIMXRT1011.internal_condition'/>
    </condition>
    <condition id='driver.ft3267.condition_id'>
      <require condition='allOf.device=MIMXRT1011.internal_condition'/>
    </condition>
