vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
    <component Cclass='Device' Cgroup='CMSIS' Csub='MIMXRT1011_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MIMXRT1011_cmsis</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1011/MIMXRT1011.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1011/MIMXRT1011_features.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1011/MIMXRT1011_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_ADC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_ADC_ETC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_AIPSTZ.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_AOI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_CCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_CCM_ANALOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_CM7_MCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_CSU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_DCDC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_DCP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_DMA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_DMAMUX.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_EWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_FLEXIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_FLEXRAM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_FLEXSPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_GPC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_GPIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_GPT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_I2S.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_IOMUXC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_IOMUXC_GPR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_IOMUXC_SNVS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_IOMUXC_SNVS_GPR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_KPP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_LPI2C.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_LPSPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_LPUART.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_OCOTP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_OTFAD.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_PGC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_PIT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_PMU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_PWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_RTWDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_SNVS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_SPDIF.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_SRC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_TEMPMON.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_TRNG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_USB.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_USBNC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_USBPHY.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_USB_ANALOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_WDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_XBARA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MIMXRT1011/periph/PERI_XTALOSC24M.h' projectpath='device/periph'/>
        <file category='include' name='devices/MIMXRT1011/'/>
        <file category='include' name='devices/MIMXRT1011/periph/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MIMXRT1011/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MIMXRT1011/template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='xip_device' Cversion='1.0.0' condition='device.boot_header.condition_id'>
      <description>Device Boot Header</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/xip/fsl_flexspi_nor_boot.c' projectpath='xip'/>
        <file category='header' name='devices/MIMXRT1011/xip/fsl_flexspi_nor_boot.h' projectpath='xip'/>
        <file category='include' name='devices/MIMXRT1011/xip/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='MIMXRT1011_linker' Cversion='1.0.0' condition='device.linker.condition_id'>
      <description>Device MIMXRT1011_linker</description>
      <files>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1011xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1011/arm/MIMXRT1011xxxxx_flexspi_nor.scf' version='1.0.0' projectpath='MIMXRT1011/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MIMXRT1011xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1011/arm/MIMXRT1011xxxxx_ram.scf' version='1.0.0' projectpath='MIMXRT1011/arm'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1011xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1011/gcc/MIMXRT1011xxxxx_flexspi_nor.ld' version='1.0.0' projectpath='MIMXRT1011/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MIMXRT1011xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1011/gcc/MIMXRT1011xxxxx_ram.ld' version='1.0.0' projectpath='MIMXRT1011/gcc'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1011xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1011/iar/MIMXRT1011xxxxx_flexspi_nor.icf' version='1.0.0' projectpath='MIMXRT1011/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MIMXRT1011xxxxx.condition_id' category='linkerScript' attr='config' name='devices/MIMXRT1011/iar/MIMXRT1011xxxxx_ram.icf' version='1.0.0' projectpath='MIMXRT1011/iar'/>
      </files>
    </component>
    <component Cclass='Board Support' Cgroup='SDK Project Template' Csub='project_template' Cvariant='MIMXRT1011' Cversion='1.0.0' condition='device.project_template.condition_id' isDefaultVariant='1'>
      <description>Devices_project_template MIMXRT1011</description>
      <files>
        <file category='header' attr='config' name='devices/MIMXRT1011/project_template/board.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1011/project_template/board.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MIMXRT1011/project_template/clock_config.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1011/project_template/clock_config.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MIMXRT1011/project_template/pin_mux.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1011/project_template/pin_mux.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MIMXRT1011/project_template/peripherals.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MIMXRT1011/project_template/peripherals.c' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MIMXRT1011/project_template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='Startup' Csub='' Cversion='1.0.0' condition='device.startup.condition_id'>
      <description>Device MIMXRT1011_startup</description>
      <files>
        <file condition='allOf.toolchains=iar.condition_id' category='sourceAsm' attr='config' name='devices/MIMXRT1011/iar/startup_MIMXRT1011.s' version='1.0.0' projectpath='startup/iar'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceAsm' attr='config' name='devices/MIMXRT1011/gcc/startup_MIMXRT1011.S' version='1.0.0' projectpath='startup/gcc'/>
        <file condition='allOf.toolchains=mdk.condition_id' category='sourceAsm' attr='config' name='devices/MIMXRT1011/arm/startup_MIMXRT1011.S' version='1.0.0' projectpath='startup/arm'/>
      </files>
    </component>
