vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='iomuxc' Cversion='2.0.4' condition='driver.iomuxc.condition_id'>
      <description>IOMUXC Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_iomuxc.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='kpp' Cversion='2.0.1' condition='driver.kpp.condition_id'>
      <description>KPP Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_kpp.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_kpp.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c' Cversion='2.6.1' condition='driver.lpi2c.condition_id'>
      <description>LPI2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_lpi2c.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_lpi2c.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_edma' Cversion='2.4.4' condition='driver.lpi2c_edma.condition_id'>
      <description>LPI2C Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_lpi2c_edma.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_lpi2c_edma.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi' Cversion='2.7.1' condition='driver.lpspi.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_lpspi.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_lpspi.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpspi_edma' Cversion='2.4.6' condition='driver.lpspi_edma.condition_id'>
      <description>LPSPI Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_lpspi_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_lpspi_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart' Cversion='2.9.1' condition='driver.lpuart.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_lpuart.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_lpuart.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lpuart_edma' Cversion='2.6.0' condition='driver.lpuart_edma.condition_id'>
      <description>LPUART Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_lpuart_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_lpuart_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='lsm6dso' Cversion='1.0.0' condition='driver.lsm6dso.condition_id'>
      <description>Driver lsm6dso</description>
      <files>
        <file category='header' name='components/sensor/lsm6dso/fsl_lsm.h' projectpath='tilt_pedo'/>
        <file category='sourceC' name='components/sensor/lsm6dso/fsl_lsm.c' projectpath='tilt_pedo'/>
        <file category='include' name='components/sensor/lsm6dso/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='max30101' Cversion='1.0.0' condition='driver.max30101.condition_id'>
      <description>Driver max30101</description>
      <files>
        <file category='header' name='components/sensor/max30101/fsl_max.h' projectpath='heartrate'/>
        <file category='sourceC' name='components/sensor/max30101/fsl_max.c' projectpath='heartrate'/>
        <file category='include' name='components/sensor/max30101/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8451q' Cversion='1.0.0' condition='driver.mma8451q.condition_id'>
      <description>Driver mma8451q</description>
      <files>
        <file category='header' name='components/sensor/mma8451q/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8451q/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8451q/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mma8652fc' Cversion='1.0.0' condition='driver.mma8652fc.condition_id'>
      <description>Driver mma8652fc</description>
      <files>
        <file category='header' name='components/sensor/mma8652fc/fsl_mma.h' projectpath='accel'/>
        <file category='sourceC' name='components/sensor/mma8652fc/fsl_mma.c' projectpath='accel'/>
        <file category='include' name='components/sensor/mma8652fc/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='mx25r_flash' Cversion='2.0.0' condition='driver.mx25r_flash.condition_id'>
      <description>Driver mx25r_flash</description>
      <files>
        <file category='header' name='components/mx25r_flash/mx25r_flash.h' projectpath='source'/>
        <file category='sourceC' name='components/mx25r_flash/mx25r_flash.c' projectpath='source'/>
        <file category='include' name='components/mx25r_flash/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='nic301' Cversion='2.0.1' condition='driver.nic301.condition_id'>
      <description>NIC301 Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_nic301.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
