vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1011_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtt template' Cversion='7.22.0' condition='driver.rtt.template.condition_id'>
      <description>RTT template configuration</description>
      <files>
        <file category='header' attr='config' name='components/rtt/template/SEGGER_RTT_Conf.h' version='7.22.0' projectpath='rtt/template'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='rtwdog' Cversion='2.1.4' condition='driver.rtwdog.condition_id'>
      <description>RTWDOG Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_rtwdog.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_rtwdog.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sai' Cversion='2.4.7' condition='driver.sai.condition_id'>
      <description>SAI Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_sai.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_sai.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sai_edma' Cversion='2.7.3' condition='driver.sai_edma.condition_id'>
      <description>SAI EDMA Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_sai_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_sai_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='sgtl5000' Cversion='2.1.1' condition='driver.sgtl5000.condition_id'>
      <description>Driver sgtl5000</description>
      <RTE_Components_h>
#ifndef CODEC_SGTL5000_ENABLE
#define CODEC_SGTL5000_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/codec/sgtl5000/fsl_sgtl5000.h' projectpath='codec'/>
        <file category='sourceC' name='components/codec/sgtl5000/fsl_sgtl5000.c' projectpath='codec'/>
        <file category='include' name='components/codec/sgtl5000/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='snvs_hp' Cversion='2.3.2' condition='driver.snvs_hp.condition_id'>
      <description>SNVS HP Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_snvs_hp.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_snvs_hp.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='snvs_lp' Cversion='2.4.6' condition='driver.snvs_lp.condition_id'>
      <description>SNVS LP Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_snvs_lp.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_snvs_lp.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spdif' Cversion='2.0.7' condition='driver.spdif.condition_id'>
      <description>SPDIF Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_spdif.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_spdif.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='spdif_edma' Cversion='2.0.8' condition='driver.spdif_edma.condition_id'>
      <description>SPDIF EDMA Driver</description>
      <files>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_spdif_edma.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_spdif_edma.c' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='src' Cversion='2.0.1' condition='driver.src.condition_id'>
      <description>SRC Driver</description>
      <files>
        <file category='sourceC' name='devices/MIMXRT1011/drivers/fsl_src.c' projectpath='drivers'/>
        <file category='header' name='devices/MIMXRT1011/drivers/fsl_src.h' projectpath='drivers'/>
        <file category='include' name='devices/MIMXRT1011/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='ssd1963' Cversion='1.2.0' condition='driver.ssd1963.condition_id'>
      <description>Driver ssd1963</description>
      <files>
        <file category='header' name='components/display/ssd1963/fsl_ssd1963.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/ssd1963/fsl_ssd1963.c' projectpath='lcdc'/>
        <file category='include' name='components/display/ssd1963/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='st7796s' Cversion='1.0.0' condition='driver.st7796s.condition_id'>
      <description>Driver st7796s</description>
      <files>
        <file category='header' name='components/display/st7796s/fsl_st7796s.h' projectpath='lcdc'/>
        <file category='sourceC' name='components/display/st7796s/fsl_st7796s.c' projectpath='lcdc'/>
        <file category='include' name='components/display/st7796s/'/>
      </files>
    </component>
